# Scale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..Scale Property
AnalysisResultSchema Class See Also
---
Multiplier used for displaying diagram or vector values in view.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Scale { get; set; }
```

Visual Basic
---
```text
Public Property Scale As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Scale {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: scale is zero or negative |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace